In [1]:
# 데이터프레임 형식
import pandas as pd

In [2]:
pd.DataFrame([1,2,3])

   0
0  1
1  2
2  3

In [4]:
pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]])

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [5]:
df=pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]])

In [7]:
df.shape

(3, 3)

In [8]:
pd.DataFrame(["사과","배","딸기"])

    0
0  사과
1   배
2  딸기

In [9]:
import numpy as np
import pandas as pd

In [10]:
data=np.array([[1,2,3],[4,5,6],[7,8,9],[10,11,12]])

In [11]:
data

array([[ 1,  2,  3],
       [ 4,  5,  6],
       [ 7,  8,  9],
       [10, 11, 12]])

In [12]:
len(data)

4

In [13]:
d=[1,2,3,3,3,3]

In [14]:
len(d)

6

In [19]:
pd.date_range('2019-09-01',periods=4)

DatetimeIndex(['2019-09-01', '2019-09-02', '2019-09-03', '2019-09-04'], dtype='datetime64[ns]', freq='D')

In [20]:
dr=pd.date_range('2019-09-01',periods=4)

In [21]:
type(dr)

pandas.core.indexes.datetimes.DatetimeIndex

In [24]:
index_date=pd.date_range('2019-09-01',periods=4)

In [25]:
column_list=['A','B','C']

In [28]:
pd.DataFrame(data, index=index_date, columns=column_list)

             A   B   C
2019-09-01   1   2   3
2019-09-02   4   5   6
2019-09-03   7   8   9
2019-09-04  10  11  12

In [29]:
table_data = {'연도':[2015,2016,2016,2017,2017],
             '지사':['한국','한국','미국','한국','미국'],
              '고객 수': [200,250,450,300,500]}

In [30]:
table_data

{'연도': [2015, 2016, 2016, 2017, 2017],
 '지사': ['한국', '한국', '미국', '한국', '미국'],
 '고객 수': [200, 250, 450, 300, 500]}

In [34]:
table_data.items()

dict_items([('연도', [2015, 2016, 2016, 2017, 2017]), ('지사', ['한국', '한국', '미국', '한국', '미국']), ('고객 수', [200, 250, 450, 300, 500])])

In [31]:
type(table_data)

dict

In [32]:
df=pd.DataFrame(table_data,columns=['연도','지사','고객 수'])

In [33]:
df

     연도  지사  고객 수
0  2015  한국   200
1  2016  한국   250
2  2016  미국   450
3  2017  한국   300
4  2017  미국   500

In [35]:
pd.DataFrame(table_data,columns=['지사','고객 수','연도'])

   지사  고객 수    연도
0  한국   200  2015
1  한국   250  2016
2  미국   450  2016
3  한국   300  2017
4  미국   500  2017

In [36]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [37]:
df.columns

Index(['연도', '지사', '고객 수'], dtype='object')

In [38]:
df.values

array([[2015, '한국', 200],
       [2016, '한국', 250],
       [2016, '미국', 450],
       [2017, '한국', 300],
       [2017, '미국', 500]], dtype=object)

In [39]:
s3=pd.Series([1,2,3,4])
s4=pd.Series([10,20,30,40,50])

In [40]:
s3+s4

0    11.0
1    22.0
2    33.0
3    44.0
4     NaN
dtype: float64

In [42]:
table_data1={'A':[1,2,3,4,5],
            'B':[10,20,30,40,50],
            'C':[100,200,300,400,500]}

In [43]:
df1=pd.DataFrame(table_data1)

In [44]:
df1

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

In [45]:
table_data2={'A':[6,7,8],
            'B':[60,70,80],
            'C':[600,700,800]}

In [46]:
df2=pd.DataFrame(table_data2)

In [47]:
df2

   A   B    C
0  6  60  600
1  7  70  700
2  8  80  800

In [48]:
df1+df2

      A      B       C
0   7.0   70.0   700.0
1   9.0   90.0   900.0
2  11.0  110.0  1100.0
3   NaN    NaN     NaN
4   NaN    NaN     NaN

In [50]:
table_data3={'봄':[256.5,264.3,215.9,223.2,312.8],
            '여름':[770.6,567.5,599.8,387.1,446.2],
            '가을':[363.5,231.2,293.1,247.7,381.6],
            '겨울':[139.3,59.9,76.9,109.1,108.1]}
columns_list = ['봄','여름','가을','겨울']
index_list = ['2012', '2013', '2014', '2015', '2016']

In [51]:
table_data3

{'봄': [256.5, 264.3, 215.9, 223.2, 312.8],
 '여름': [770.6, 567.5, 599.8, 387.1, 446.2],
 '가을': [363.5, 231.2, 293.1, 247.7, 381.6],
 '겨울': [139.3, 59.9, 76.9, 109.1, 108.1]}

In [54]:
df3=pd.DataFrame(table_data3, columns = columns_list, index=index_list)

In [55]:
df3

          봄     여름     가을     겨울
2012  256.5  770.6  363.5  139.3
2013  264.3  567.5  231.2   59.9
2014  215.9  599.8  293.1   76.9
2015  223.2  387.1  247.7  109.1
2016  312.8  446.2  381.6  108.1

In [57]:
df3.mean()

봄     254.54
여름    554.24
가을    303.42
겨울     98.66
dtype: float64

In [58]:
df3.std()

봄      38.628267
여름    148.888895
가을     67.358496
겨울     30.925523
dtype: float64

In [59]:
df3.mean(axis=1)

2012    382.475
2013    280.725
2014    296.425
2015    241.775
2016    312.175
dtype: float64

In [60]:
df3.std(axis=1)

2012    274.472128
2013    211.128782
2014    221.150739
2015    114.166760
2016    146.548658
dtype: float64

In [62]:
df3.describe()

                봄          여름          가을          겨울
count    5.000000    5.000000    5.000000    5.000000
mean   254.540000  554.240000  303.420000   98.660000
std     38.628267  148.888895   67.358496   30.925523
min    215.900000  387.100000  231.200000   59.900000
25%    223.200000  446.200000  247.700000   76.900000
50%    256.500000  567.500000  293.100000  108.100000
75%    264.300000  599.800000  363.500000  109.100000
max    312.800000  770.600000  381.600000  139.300000

In [63]:
df3_mean2['2016']

NameError: name 'df3_mean2' is not defined

In [64]:
df3_mean2[['2015','2016']]

NameError: name 'df3_mean2' is not defined

In [65]:
type(df3_mean2['2016'])

NameError: name 'df3_mean2' is not defined

In [66]:
type(df3_mean2[['2015','2016']])

NameError: name 'df3_mean2' is not defined

In [67]:
import pandas as pd
import numpy as np

KTX_data = {'경부선 KTX': [39060, 39896, 42005, 43621, 41702, 41266, 32427],
            '호남선 KTX': [7313, 6967, 6873, 6626, 8675, 10622, 9228],
            '경전선 KTX': [3627, 4168, 4088, 4424, 4606, 4984, 5570],
            '전라선 KTX': [309, 1771, 1954, 2244, 3146, 3945, 5766],
            '동해선 KTX': [np.nan,np.nan, np.nan, np.nan, 2395, 3786, 6667]}
col_list = ['경부선 KTX','호남선 KTX','경전선 KTX','전라선 KTX','동해선 KTX']
index_list = ['2011', '2012', '2013', '2014', '2015', '2016', '2017']

df_KTX = pd.DataFrame(KTX_data, columns = col_list, index = index_list)
df_KTX

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2011    39060     7313     3627      309      NaN
2012    39896     6967     4168     1771      NaN
2013    42005     6873     4088     1954      NaN
2014    43621     6626     4424     2244      NaN
2015    41702     8675     4606     3146   2395.0
2016    41266    10622     4984     3945   3786.0
2017    32427     9228     5570     5766   6667.0